# coding: utf-8

# Colors
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
GOLD = (255, 216, 0)
SILVER = (192, 192, 192)
COPPER = (192, 112, 48)
LBLUE = (0, 192, 255)
PINK = (255, 0, 224)
CYAN = (0, 255, 255)
GRAY = (96, 96, 96)

BLINK = [
    (224, 255, 255),
    (192, 240, 255),
    (128, 224, 255),
    (64, 192, 255),
    (128, 224, 255),
    (192, 240, 255),
]

PROLOGUE_LINES = [
"――この洞窟には、魔物が棲んでいる", "", 
"その噂を聞きつけ　この夜　１人の男が入り口に立っていた", "", 
"男はかつて　自分以外の一族をみな　魔物に殺された", "", 
"その時に両親から託されたペンダントを　ずっと形見にしている", "", 
"当時はまだ幼かったので　記憶は曖昧だが", "", 
"ペンダントを握ると　失われかけた記憶が　形を取り戻すのだ", "", 
"目の前で死んでいく両親と　その両親を見下ろす魔物の姿を――", "", 
"男は　復讐の心に背中を押され　洞窟の中へと足を踏み入れた。", ""
]

EVENT_TALK = [ #戦闘が始まるのではなく、フロア上で発生する単なる会話ウィンドウのイベント
    ["生き物「この洞窟に住んでいる魔物は　調理して食べると美味しいものが多いよ」","生き物「実際にボクが食べたことがあるわけではないよ\nそういう記録が残っているんだ」"],#4階
    ["空き缶が　捨てられている\n両親がよく飲んでいたから　見覚えがある","かつて一族のものが　ここにきていたのだろうか\nあるいは、一族を襲った魔物が持ち帰ったのかもしれない。"],#14階
    ["巨大な木材と金属板を重ねて作られた壁が　内側へ大きくひしゃげている\nかつて作られたバリケードが　破壊されてしまっているようだ"],#24階
    ["小さな魔物「この洞窟で　ぼくたちが生き延びている理由は\n傷ついた仲間をいやしてくれる　おやぶんがいるからだ」","小さな魔物「何度やられても　また動けるようになるんだ\nだから　ぼくたちは　何度でも戦えるのさ」","小さな魔物「おやぶんの名前？\nシュテルゴンって　いうんだ」"],#34階
    ["壁に　星の形をした模様がある\nこの模様は　どこかで見たことがある……"],#44階
    ["生き物「おっ！ニンゲンだ！」","生き物「この洞窟に　とんでもなく強いニンゲンが現れたと聞いて\n顔を出しているんだ」", "生き物「でも　聞いていた見た目と違うなあ\n青い髪だって　聞いたのだけど」"],#54階
    ["檻の中に　鎖がある\nまるで　なにかを監禁していたかのような　痕跡だ"],#64階
    ["この階層は　とても人工的な造りになっている\nかつてはなにかの　施設だったのだろうか……"],#74階
    ["魔物が　息絶えている。", "身体には　剣で斬られた跡があり\nまだ　血が乾いていなかった\nよく見ると　爪やツノが　残っていない"],#84階
]

BOSS_INIT_TALK = { # 戦闘前の会話
    0: [#10階
        "巨大な影が　目の前に立ちはだかっている\n鳥の魔物のようだが　これまでの魔物とは　比べものにならないほどの大きさだ",
        "ディノルニス「おれは　飛ぶことができない　……つばさが　ないのだ\nもし　飛ぶことができたら……　そう思ったことは　何度もある」",
        "ディノルニス「決して　空の旅を　夢見ているわけではない\nつばささえあれば　おれは今もなお　もっと自由に生きていた」",
    ],
    1: [#20階
        "獣の遠吠えが　聴こえてきた\nなぜか　あの夜が　頭に浮かんでくる……",
        "マガミスティン「また　ニンゲンが　きたか……」",
        "マガミスティン「かつて俺が　お前の一族を襲ったのかだって？\nなるほど貴様　あのときの残党か……」",
        "マガミスティン「穢れた連中め\n跡形もなく　引き裂いてやる」",
    ],
    2: [#30階
        "背中に赤い炎をもつ魔物が　静かにこちらを見ている。\nその姿は　どこか　異様なほどに美しかった。",
        "レッドホープ「わたくし達の赤い炎に　ニンゲンはみな　目を奪われる」",
        "レッドホープ「しかし　この美しさが\nときに　身を滅ぼすのです」",
        "レッドホープ「醜い生き物よ\nあなたの傲慢な心を　わたくしが正しましょう」",
    ],
    3: [#40階
        "静かな水面の中央で　カイギュウのような魔物が　祈りを捧げている",
        "シュテルゴン「旅人よ。けがをしておられるようです。\n手当ていたしますので　少しじっとしていてください」",
        "シュテルゴン「これで元気になられたかと思います\nえ？　わたしが他の仲間たちを　治療しているのかって？」",
        "シュテルゴン「そうです。\nわたくしは　傷ついている者を見ると　治さずにはいられない」",
        "シュテルゴン「わたしを　殺そうというのならば　立ち向かいましょう\n仲間のために　死ぬわけにはいかない」",
    ],
    4: [#50階
        "低いうなり声が　聴こえてくる",
        "ジャバン「かつて施設で　貴様らを何人も殺した\nあの日の恐怖を忘れたのか　また何人も何人も　ニンゲンはここにやってくる」",
        "ジャバン「その匂い　我が友　マガミスティンを　殺したようだな！」",
        "ジャバン「貴様らへの恨みは尽きることがない……\n何度奪えば　気が済むというのだ！！」",
    ],
    5: [#60階
        "サイの魔物は　こちらに気がつくと　勢いよく向かってきた",
        "サイファトゥ「俺はかつて　立派なツノを持っていた」",
        "サイファトゥ「だがあの日　ニンゲンにやられて　俺はツノを失った！」",
        "サイファトゥ「俺にとって　ツノを失うことが\nどれほどの辱めに値するか　貴様に理解できるか！」",
    ],
    6: [#70階
        "キラキラとした　オーラをまとった鳥の魔物が　翼を広げている",
        "キン「ニンゲンよ\nひとつ　聞きたいことがあります」",
        "キン「なぜいつも　私たちを　滅ぼしたがるのでしょうか」",
        "キン「ドウブは　ニンゲンの乱獲によって　地球から姿を消したとされています\n実際には　この洞窟で　生き延びていますが……」",
        "キン「他の生き物たちも　同じです\n最後に彼らをこの世界から消したのは　いずれもニンゲンでした」",
        "キン「自らの行いを　償わせるまで　私たちは戦います」",
    ],
    7: [#80階
        "聞き覚えのある　唸り声と共に　トラの魔物が　現れた",
        "ジャバン「あの夜　貴様らニンゲンが　施設へ押し入った」",
        "ジャバン「炎　叫び声　血の匂い……\n施設の者は　みな殺されてしまった！」",
        "ジャバン「あの夜　俺はかろうじて　１つの仲間の命を守り\n貴様らニンゲンを　返り討ちにした」",
        "ジャバン「この尽きない恨みが　晴れるまで　俺は戦い続ける……！」",
    ],
    8: [#90階
        "巨大な樹木が　そびえ立っているかのように見える",
        "よく見るとそれは　巨大なマンモスの魔物だった",
        "サンゲニウス「ここは　我々にとって　最後の場所なのだ」",
        "サンゲニウス「かつてここで滅びた　ニンゲンの一族と　同じ道は歩まぬ」",
    ],
    9: [#100階
        "ひとりの　ニンゲンが立っている",
        "ニンゲン「人間じゃないか\nということは　お前も同業か？」",
        "ニンゲン「この古い施設にいる生き物は　珍しい素材を持っていて助かるよな\nサイのツノやトラの爪なんかは　かなり高価で取引される」",
        "ニンゲン「昔　ここを襲撃したときは　施設の人間に邪魔されちまったからなあ」",
        "ニンゲン「あの日は多くの仲間を　動物に殺されてしまったが……\n今日は　邪魔がなくて助かるぜ」",
        "ニンゲン「え？　その時の　施設の人間をどうしたかって？\nもちろん　皆殺しにしたよ」",
        "ニンゲン「……なんだ　お前まさか　施設の人間の生き残りか！\n死に損ないめ　ここでお前も　殺してやろう！」",
    ]
}
BOSS_END_TALK = {# 戦闘後の会話
    0: [#10階
        "ディノルニス「……またしても……ニンゲンに……負けてしまった……」",
        "ディノルニス「……やはり俺にも……翼が……」",
        "巨大なトリの魔物は　息絶えた",
    ],
    1: [#20階
        "マガミスティン「！？\nその　ペンダントは……そうか……」",
        "マガミスティン「お前は　あの夜……」",
        "オオカミの魔物は　言い切ることなく　地面に横たわった",
    ],
    2: [#30階
        "レッドホープ「命のともしびが　消えていく……\n叶うならば　来世は　美しくありませぬように……」",
        "やがて　魔物の背中の炎は消え\n辺りはすっかり　薄暗くなった",
    ],
    3: [#40階
        "シュテルゴン「どうか　仲間たちに　癒しの未来を……」",
        "カイギュウの魔物は　倒れた\nこれで　ほかの魔物を治療されることは　もうないだろう",
    ],
    4: [#50階
        "ジャバン「……あの夜も　今宵も\n貴様らのようなニンゲンは　おれの大事な存在を奪っていく……」",
        "ジャバン「ここで終わってたまるか……」",
        "トラの魔物は　足を引きずって　暗闇の中へと　消えていった",
        "しかし　魔物の言葉が引っかかる\nあの夜　命を奪ったのは　自分たち人間だったとでも言うのだろうか……？"
    ],
    5: [#60階
        "サイファトゥ「……くそっ！俺のツノは……！」",
        "ツノがないサイの魔物は　膝をついた",
        "サイファトゥ「誇りを奪っていく　極悪非道な生き物め……」",
        "それがサイの魔物の　最後の言葉だった"
    ],
    6: [#70階
        "キン「必ず　その罪を　償うときが　あなたにはくる……」",
        "キンは地面に墜落し　光の粒が一斉に散った",
        "魔物の言葉の通りならば　魔物もまた　復讐のために戦っているのだろう\nそうだとしたら　自分の復讐は　正当化されるのだろうか",
        "だがそれでも　両親を失ったという事実は　変わらない\n男は　剣を握りしめ　先へ進む決意を新たにした"
    ],
    7: [#80階
        "死にかけのトラの魔物に　とどめを刺そうと近づいた",
        "ジャバン「……貴様　そのペンダント……！\nそんな……まさか……」",
        "ジャバン「……ここの最奥の……記録を…………」",
        "トラの魔物は　何かを言い残して　崩れ落ちた\nもう　とどめの一撃を与える必要は　なかった",
    ],
    8: [#90階
        "サンゲニウス「……敗北か……信じられぬ……」",
        "マンモスの魔物は　もう身体が動かない様子だった",
        "サンゲニウス「今日はニンゲンがよく訪れる……先ほどの　青い髪の奴といい……」",
        "巨大なマンモスは　静かに崩れ落ちた",
        "マンモスが言っていた「かつてここで滅びた　ニンゲンの一族」は\n自分の両親がいた一族のことだろう",
        "だとすると　なぜここに……"
    ],
}

WALL_BOOK = {
    36: [
        "xxxの調理方法",
        "1. 石を火で十分に熱し、掘った穴に石を入れる",
        "2. 石の上に大きなモモ肉の塊を乗せる",
        "3. 水を加えて蒸気を発生させる",
        "4. 葉などで覆い、さらに土を被せる",
        "5. 数時間かけてじっくり蒸し焼きにする"
    ],
    46: [
        "ここ最近　襲撃の頻度が高まっている\n我々は襲撃に備え　バリケードを建設することとした",
        "ここにいるものたちの　安全を確保しなければならない\n次に　やつらがここへやってくれば\nいよいよ危ないかもしれない",
        "襲撃のたび　辺り一帯には\n吠え喚く声が　鳴り響く",
        "今回建設するバリケードまで破られれば\n我々も　もう持ちこたえられないだろう",
    ],
    56: [
        "傷ついたものがいれば　彼らはすぐに駆け寄った\n癒しを司る彼らは　すぐにその傷を治すことができる",
        "命が失われそうならば　放っておくことができない\nそれは彼らの一族に　代々受け継がれてきた性分らしい",
        "ここにいる多くのものが　今日まで生き延びてこられたのは\n彼らの献身によるところが　大きい",
    ],
    66: [
        "本日の見世物では　遠い地より運ばれた　巨大なクマを闘技場へ放った\nクマの迫力のある戦いに　観客は立ち上がり　大きな歓声をあげた",
        "とりわけクマが　相手を打ち倒した瞬間には　闘技場全体が　地響きのような歓声に包まれた\n次の催しのため　さらに多くのクマを　用意する必要がある",
    ],
    76: [
        "今から　遥か昔\nひとりの旅人が　広大な湿地で\n青く美しく輝く　生き物を見つけた",
        "旅人がその生き物に触れると\n身体に　不思議な力がみなぎるのを感じた",
        "その話が町へ伝わると\n人々は　青く美しい毛皮を求めて\n次々と湿地へ向かった",
        "やがて　その毛皮から作られた\n「魔力の鎧」が　町にあふれるようになった",
        "そしていつしか\n青く美しく輝く生き物を\n湿地で見る者はいなくなった"
    ],
    86: [
        "『作戦概要』\n目的地：〇〇区域　対象：飼育区画",
        "『取引情報』\n用途：解熱・解毒・滋養\n取引価格：XXXX\n目標数：20本",
        "対象には　遠距離から攻撃すること\n動かなくなったことを確認してから　回収作業に移れ",
    ],
}

WALL_BOOK_TITLES = {
    36: "xxxの調理方法",
    46: "バリケードの建設",
    56: "癒しを司る者",
    66: "闘技場のクマ",
    76: "青く美しい生き物",
    86: "作戦概要",
}

WALL_CHECK = {
    11: [
        "壁は　薄気味悪い緑色で　うっすら光っているように見える",
        "なにか　化学実験のような　そんな質感を　漂わせている",
    ],
    21: [
        "この階は　耐熱性の高そうな壁で　構成されている",
        "ここまでは　人間も足を踏み入れて　整備してきたのだろうか",
    ],
    31: [
        "地下水に沈むここの壁は　古い岩が露出しており　古代の化石がときおり目に入る",
        "その中には　ここにいる魔物のような　形の骨をしたものもある",
    ],
    41: [
        "水がなくなり　黒く硬い土が露出している",
        "無機質な寒気に覆われたここ一体は　なにか人間への意思を感じる……",
    ],
    51: [
        "まるで砂漠のような　乾燥した砂で満たされた空間だ",
        "本来　こんな地下深い場所に　存在する砂の質では　ないはずだが……",
    ],
    61: [
        "まるで冷凍室かのような　氷に覆われた空間だ",
        "手がかじかんで　まともに戦闘するのも難しい……",
    ],
    71: [
        "ここまでの空間とは大きく違って　人工的な構造になった",
        "非常に重苦しい空気が漂っている　かつては人間に厳重に管理されていたかのような空気だ",
    ],
    81: [
        "不思議なエネルギーで　溢れている空間だ",
        "かつて　ここで何が　起きていたのだろうか",
    ],
    91: [
        "地面のひび割れから覗く　赤い溶岩が　この洞窟の怒りを表現しているかのようだ",
        "この場所に　長くいるだけで　正気を失いそうに感じる",
    ],
}

EXTRA_BOSS_TALK = {
    120: [
        "ブルーハンター「魔物の側に立った人間か\nならば貴様も狩るのみだ」",
    ],
    121: [
        "レッドハンター「ラッキー！\nお前のペンダントも　高く売れそうだ」",
    ],
    122: [
        "グリーンハンター「ペンダントの魔物……噂の通りだ\nここは　力試しといこう」",
    ],
}

BOSS_LASTTALK1 = [ # ノーマルエンド
    "ニンゲン「くそ……じゃましやがって……」",
    "目の前のニンゲンは　そう言い残して　死んだ",
]
BOSS_LASTTALK2 = [ # 真エンド
    "ニンゲンは　崩れ落ちた",
    "ニンゲン「ぐっ……こんな　動物どもに\n肩入れしやがって……！」",
    "ニンゲン「無駄だぞ。そんなことしても、どうせまた人間はこいつらを狩り尽くす」",
    "青髪の男は　血を吐きながら笑った",
    "「角が高く売れれば取る。毛皮が売れれば剥ぐ。肉がうまけりゃ食う。そういうもんだろ……」",
    "青髪の身体が横へ倒れ、しばらく痙攣したあと、動かなくなった。",
]

TRUE_EPISODE_TALK = [#100階の会話ウィンドウのイベント
    "古い資料が　残っている\n施設でのできごとが　記録されているようだ",
    "『給餌記録』\n『治療経過』\n『保護区域 拡張案』",
    "すべての記録には　星形のマークが描かれていた\nそれらは　胸元のペンダントの模様と一致している", 
    "記録には　次のように書かれていた", 
    "『野生のトラ　負傷個体を保護』\n『サンプルのオオカミ　繁殖を確認』", 
    "『外部武装集団による襲撃を確認』\n『保護対象の避難を優先すること』", 
    "そこで　記録は途切れている",
    "記録者の欄には　自分の両親の名前が　書かれていた",
]

TRUE_EPISODE_MEMORY_TEXTS = [
    "すべての記憶が蘇ってきた。",
    "幼い自分が廊下を走っている。\n周囲には炎と煙が満ち、人間たちの怒号が響いていた。",
    "父親が叫んでいる。\n「保護区を閉めろ！　やつらを奥へ入れるな！」",
    "顔を布で隠した人間たちが、銃や刃物を持って施設の中へ入ってくる。\n後ろでガラスが割れ、動物たちの鳴き声が響く。",
    "母親は小さな収納庫の扉を開け、自分はそこに押し込まれた。",
    "『ここから出ないで』\n『大丈夫だから』",
    "母は首から星形のペンダントを外し、自分の首へかけた。\n『なくさないで。仲間の印よ』\n母はその言葉を残して、扉を閉じた。",
    "外からは激しい銃声が聞こえていたが、気がつくと銃声は鳴りやんでいた。",
    "おそるおそる扉を開けると\n\nそこには、血を流して倒れる父と母",
    "そして、２人のそばには、\n悔しそうな顔をした、オオカミとトラが立っていた。",
]

EPILOGUE_THANKS_TEXTS = [
    "Thank you for playing!",
]

EPILOGUE_LINES = [
"――この洞窟には、絶滅した動物たちが棲んでいる", "",
"その噂を聞きつけ　たびたび　密猟者がこの洞窟にやってくる", "", 
"しかし　この洞窟に深入りした密猟者は　二度と帰ってくることはない", "",
"ペンダントをかけた男に　必ず返り討ちにされるからだ", "",
"いつしか密猟者たちは、その存在をこう呼ぶようになった","",
"――ペンダントの魔物","",
"","",
"男は　かつて破壊されたバリケードを　新しい木材と金属で　作り直した","",
"それは　魔物から人間を　守るためではない","",
"ニンゲンから動物を　守るためだ","",
]

TUTORIAL_WALL_TALK = {
    1: [
        "ようこそ　ニンゲン……この洞窟にきたことを　素直に歓迎しよう\nわたしは　中立の立場で　この洞窟を案内する者だ",
        "まずは　先にある部屋へと　進みたまえ",
    ],
    2: [
        "洞窟には　宝箱が落ちている……\n宝箱の中身を確認したら　次の部屋で戦闘を試すといいだろう",
    ],
    3: [
        "ここでの戦闘は　「攻撃」を使って　敵を倒すことが目的だ\nまずは戦闘に　慣れるのだ",
    ],
    4: [
        "メニューの「どうぐ」から　拾ったアイテムを使用できる\nこの部屋ではアイテムを拾って　実際に使ってみるのだ",
    ],
    5: [
        "魔法は　戦闘中に魔力を消費して使う\n魔法を使うと　敵に大ダメージを与えられるぞ",
    ],
    6: [
        "階段は　次の階へ進むための出口だ\nここまでの内容が理解できたなら　階段を使って　次の階へ進むといい……",
    ],
}

FLOOR100_EVENT_UNREADABLE_TALK = [
    "何かが書いてある。しかし、文字がかすんでいて\nうまく読むことができない",
]

FLOOR100_EVENT_USE_FRAGMENT_PROMPT = [
    "しんじつのかけらを　使いますか？",
]

END_ROLL = [
    "監督：KOYO KUZE",
    "MUSIC：KOYO KUZE",
    "イラスト：KOYO KUZE/RIN/KYOSUKE",
    "プログラム：KOYO KUZE",
    "企画・制作：KOYO KUZE",
]

ITEM_WALL_WEAPON_SET_TALK = [
    "おお　ニンゲンよ。ここから先は　新たな武具がないと　きびしいだろう。",
    "これを授けよう",
]

FAIRY_UPGRADE_TALK = [
    "神秘的な　力を　感じる\nアイテムを　強化することができそうだ",
    "どのアイテムの力を　強くしますか？",
]

ITEM_WALL_WEAPON_SET = {
    11: (1, (0, 1, 2)),   # Lv1: 防御の盾, 癒しの鎧, 会心の剣
    31: (20, (3, 4, 5)),  # Lv20: 反撃の盾, 魔力の鎧, 凍氷の杖
    61: (40, (6, 7, 8)),  # Lv40: 守護の盾, 薬効の鎧, 毒霧の砲
}
LOCKED_STAIRS_ITEM_WALL_FLOORS = {11, 31, 61}
FAIRY_FLOOR_MODS = {3, 8}

MENU = ["どうぐをみる","記録を見る", "装備を変える", "設定を変える", "タイトルに戻る"]
TRE_NAME = [
    "傷薬", "爆弾", "守護", "薬草", "精霊水", "魔結晶",
    "成長エキス", "剣の牙石", "盾の甲片", "鎧の殻核", "しんじつのかけら", "ワープの書"
]
WPN_NAME = [
    "防御の盾",
    "癒しの鎧",
    "会心の剣",
    "反撃の盾",
    "魔力の鎧",
    "凍氷の杖",
    "守護の盾",
    "薬効の鎧",
    "毒霧の砲",
]
EMY_APPEAR_BASE_MAX = (
    0, 1, 1, 2, 2, 3, 3, 4, 4, 4,
    5, 5, 5, 6, 6, 6, 7, 7, 7, 7,
    8, 8, 8, 9, 9, 9, 9, 9, 9, 9,
    1, 1, 2, 2, 3, 3, 4, 4, 4, 4,
    5, 5, 5, 6, 6, 6, 7, 7, 7, 7,
    8, 8, 8, 9, 9, 9, 9, 9, 9, 9,
    1, 1, 2, 2, 3, 3, 4, 4, 4, 4,
    5, 5, 5, 6, 6, 6, 7, 7, 7, 7,
    8, 8, 8, 9, 9, 9, 9, 9, 9, 9,
    9, 9, 9, 9, 9, 9, 9, 9, 9, 9,
)
EMY_APPEAR = {
    floor: tuple(range(max_id + 1)) + (
        (10,) if 31 <= floor <= 40 else
        (11,) if 61 <= floor <= 70 else
        (12,) if 91 <= floor <= 100 else
        ()
    )
    for floor, max_id in enumerate(EMY_APPEAR_BASE_MAX, 1)
}
EMY_RUNTIME_IDS = [*range(0, 13), *range(110, 123)]
EMY_ZUKAN_IDS = EMY_RUNTIME_IDS
EMY_ZUKAN_CROP = {
    0: (34, 34),
    1: (34, 34),
    2: (94, 124),
    3: (104, 40),
    4: (110, 250),
    5: (175, 50),
    6: (224, 104),
    7: (174, 204),
    8: (104, 115),
    9: (254, 114),
    10: (104, 134),
    11: (260, 210),
    12: (34, 34),
    110: (360, 114),
    111: (104, 115),
    112: (175, 50),
    113: (180, 170),
    114: (280, 254),
    115: (165, 340),
    116: (265, 284),
    117: (280, 254),
    118: (274, 220),
    119: (124, 54),
    120: (124, 54),
    121: (124, 54),
    122: (124, 54),
}

EMY_NAME = {
    0: "ドウブ", 1: "ベニドウブ", 2: "コシンジョ", 3: "ロンザム", 4: "サイナジン",
    5: "ブルーホープ", 6: "レイン", 7: "ボナパルト", 8: "ジスティン", 9: "アースベア",
    10: "ダムラ", 11: "コークガウ", 12: "アイアンドウブ",
    110: "ディノルニス", 111: "マガミスティン", 112: "レッドホープ", 113: "シュテルゴン",
    114: "ジャバン", 115: "サイファトゥ", 116: "キン", 117: "ジャバン", 118: "サンゲニウス",
    119: "ニンゲン", 120: "ブルーハンター", 121: "レッドハンター", 122: "グリーンハンター"
}
EMY_LIFE_NORMAL = {
    0: 90, 1: 118, 2: 122, 3: 200, 4: 180, 5: 240, 6: 280, 7: 300, 8: 330, 9: 410,
    10: 280, 11: 340, 12: 10,
    110: 5100, 111: 7700, 112: 40000, 113: 14000, 114: 25000, 115: 11000,
    116: 32000, 117: 39000, 118: 36000, 119: 7643, 120: 61564, 121: 35000, 122: 25000
}
EMY_LIFE_HARD = {
    0: 92, 1: 120, 2: 125, 3: 208, 4: 186, 5: 246, 6: 286, 7: 312, 8: 340, 9: 425,
    10: 290, 11: 355, 12: 12,
    110: 7100, 111: 10700, 112: 50000, 113: 18000, 114: 32000, 115: 16000,
    116: 36000, 117: 55000, 118: 42000, 119: 9643, 120: 71564, 121: 45000, 122: 35000
}
EMY_STR_NORMAL = {
    0: 15, 1: 30, 2: 50, 3: 35, 4: 45, 5: 50, 6: 45, 7: 52, 8: 70, 9: 100,
    10: 65, 11: 90, 12: 35,
    110: 120, 111: 160, 112: 150, 113: 220, 114: 295, 115: 195,
    116: 445, 117: 510, 118: 890, 119: 0, 120: 550, 121: 560, 122: 750
}
EMY_STR_HARD = {
    0: 16, 1: 32, 2: 53, 3: 37, 4: 47, 5: 53, 6: 47, 7: 55, 8: 74, 9: 108,
    10: 70, 11: 98, 12: 37,
    110: 128, 111: 170, 112: 158, 113: 255, 114: 340, 115: 250,
    116: 500, 117: 530, 118: 910, 119: 0, 120: 560, 121: 580, 122: 820
}
EMY_LIFE_BY_MODE = {"normal": EMY_LIFE_NORMAL, "hard": EMY_LIFE_HARD}
EMY_STR_BY_MODE = {"normal": EMY_STR_NORMAL, "hard": EMY_STR_HARD}
EMY_EXP = {
    0: 400, 1: 450, 2: 500, 3: 550, 4: 600, 5: 650, 6: 4800, 7: 750, 8: 800, 9: 1350,
    10: 900, 11: 1200, 12: 1500,
    110: 3000, 111: 5000, 112: 22000, 113: 7000, 114: 9000, 115: 11000,
    116: 13000, 117: 15000, 118: 17000, 119: 0, 120: 30000, 121: 30000, 122: 30000,
}
EMY_APRO = {
    0: 1, 1: 1, 2: 1, 3: 0.9, 4: 0.8, 5: 1, 6: 0.8, 7: 1, 8: 1.1, 9: 1,
    10: 1.2, 11: 0.8, 12: 0.04,
    110: 0.9, 111: 1.1, 112: 1.2, 113: 1, 114: 1, 115: 0.9, 116: 1.2, 117: 1,
    118: 0.7, 119: 1, 120: 1, 121: 1, 122: 0.3,
}
EMY_MPRO = {
    0: 1, 1: 1, 2: 1, 3: 1, 4: 1.1, 5: 0.8, 6: 1, 7: 0.9, 8: 0.9, 9: 1,
    10: 0.9, 11: 0.9, 12: 0.04,
    110: 1.1, 111: 0.7, 112: 0.6, 113: 1.1, 114: 1, 115: 1.1, 116: 1, 117: 1,
    118: 1.8, 119: 0.6, 120: 1, 121: 1, 122: 0.6,
}
EMY_BPRO = {
    0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1.3, 7: 1.2, 8: 1, 9: 1,
    10: 0.9, 11: 1, 12: 0.04,
    110: 1, 111: 0, 112: 1, 113: 0, 114: 1, 115: 0.5, 116: 0.7, 117: 1,
    118: 1, 119: 1.5, 120: 0.7, 121: 0.7, 122: 0.6,
}
EMY_MAG_GAIN = {
    0: 0, 1: 2, 2: 4, 3: 6, 4: 8, 5: 10, 6: 12, 7: 14, 8: 70, 9: 16,
    10: 14, 11: 20, 12: 20,
    110: 220, 111: 222, 112: 224, 113: 226, 114: 228, 115: 230,
    116: 232, 117: 234, 118: 236, 119: 240, 120: 1000, 121: 1000, 122: 1000,
}

ENEMY_INFO = {
    0: "飛べないのろまな鳥の魔物\n特別な能力はない",
    1: "飛べないのろまな鳥の魔物（亜種）\n特別な能力はない",
    2: "魚などの小動物を捕食する小型の肉食魔獣\nたまに会心の一撃を発動する",
    3: "首が長いカメの魔物\n体力が高く、やや通常攻撃が効きにくい",
    4: "背中に草が生えたサイの魔物\nたまに力をためて、強力な一撃を繰り出す\n通常攻撃よりも魔法が効きやすい",
    5: "美しい青色の炎を宿す魔物\n攻撃した相手に魔力を付与する\n魔法がやや効きにくい",
    6: "上半身は虹色の縞模様、下半身は金の毛並みを持つ魔物\n経験値がとても高いが、すぐに逃げてしまう\n通常攻撃がやや効きにくく、爆弾が効きやすい",
    7: "香りのある実がなる植物の魔物\n毎ターン生命が回復する\n魔法がやや効きにくく、爆弾がやや効きやすい",
    8: "隻眼のオオカミの魔物\n毒の爪で攻撃をしかける\n通常攻撃にやや弱く、魔法にやや強い\n倒すと魔力を少し多く得られる",
    9: "肩で惑星の環を支える凶暴なクマの魔物\n特別な能力はないが、必ず成長エキスを落とす",
    10: "変わった頭の形をしたサメの魔物\n通常攻撃に対して反撃を行う\n通常攻撃がやや効きやすい",
    11: "凍りつく大地で生き続ける魔物\nまれに凍結状態を付与する攻撃を行う",
    12: "飛べないのろまな鳥の魔物\nただし突然変異で身体が硬質化している\n特別な能力はない",
    110: "飛べない巨大な鳥の魔物\n時に攻撃を防御し、たまに会心の一撃を発動する",
    111: "隻眼のオオカミの魔物\nこの敵の攻撃を喰らうと、時に毒が付与される\n毒状態になると、体力の減少と攻撃の低下が起こる。\n通常攻撃にやや弱く、爆弾は効かない",
    112: "美しい赤色の炎を宿す魔物\n攻撃したときに魔力を吸収する\n爆弾をくらうと火傷状態になり、自傷を伴いつつも攻撃力が上がる\n火傷した敵に攻撃すると火傷ダメージをくらう\n魔法攻撃が非常に効きにくい",
    113: "惑星の冠を帯びたジュゴンの魔物\n傷薬を無効化する能力を持つ\n爆弾は無効だが、ひるませることはできる",
    114: "手から爆風を生み出すトラの魔物\n残り生命の９割を削る「覇炎」を使用する\n覇炎を受けると火傷状態となり、お互い通常攻撃にダメージを伴う\n守護を無効化する",
    115: "背中に花が生えたサイの魔物\n力をためない時はからだをかため、次に受ける攻撃を大きく軽減する\n通常攻撃よりも魔法が効きやすく、爆弾は効きにくい",
    116: "キラキラとしたオーラをまとったトリの魔物\nアイテムを使用するとマギアをチャージする\nチャージの量は　残り生命が大きいほど多い\nマギアは1000たまると　攻撃として放出される\nやや通常攻撃が効きやすい。",
    117: "手から爆風を生み出すトラの魔物\n連続発動するほど威力が上がる「豪炎」を使用する\n豪炎を受けると火傷状態となり、お互い通常攻撃にダメージを伴う\n体力が減るほど攻撃力が上がる\n守護を無効化する",
    118: "樹木のようにそびえ立つゾウの魔物\nくらった攻撃に応じて状態が変化する\n氷状態は体力が自動回復し、魔法が無効になる。\n炎状態では攻撃力が増加し、爆弾が無効になる。\n通常攻撃が効きにくく、魔法は効きやすい",
    119: "魔物を滅ぼすニンゲンのすがた\nそれはまるで　鏡写しのように　かつてのあなたを映し出す",
    120: "魔物を滅ぼすニンゲンのハンター\n体力が減るほど攻撃力が上がる\n魔法に対しては毒攻撃を返す\nアイテムを使用するとマギアをチャージする",
    121: "魔物を滅ぼすニンゲンのハンター\n発動するほど威力が上がる「豪炎」を使用する\n豪炎を受けると火傷状態となり、お互い通常攻撃にダメージを伴う\n力をためない時はからだをかため、次に受ける攻撃を大きく軽減する",
    122: "魔物を滅ぼすニンゲンのハンター\nくらった攻撃に応じて状態が変化する\n氷状態は体力が自動回復し、魔法が無効になる。\n炎状態では攻撃力が増加し、爆弾が無効になる。",
}

DEATH_HINTS = {
    "default": "生命が少なくなったら　早めに傷薬や守護を使おう。\n敵の情報を確認して　弱点に合わせた行動を選ぶことも重要だ。",
    "enemy_7": "ボナパルトと戦う時に傷薬を使う場合は、ボナパルトの回復をムダにするために\n戦闘の最初に使うようにしよう。",
    "boss_110": "ディノルニスはたまに会心の一撃を繰り出す。\n残りの生命に気をつけて戦おう",
    "boss_111": "毒状態では通常攻撃で与えられるダメージが大きく減少してしまうことに気をつけよう",
    "boss_112": "レッドホープは、火傷状態にすると大きな自傷ダメージをくらわせることができる。\nアイテムが豊富にあるときは、火傷状態にしながら戦おう",
    "boss_40": "シュテルゴンは　傷薬の効果を無効にする。\n守護や防御の盾、癒しの鎧を活用して　粘り強く戦おう",
    "boss_114": "デストロイは残り生命を10%にする技だ。\n自分のHPは少ない時は、あえてデストロイを使わせるのも作戦だ。",
    "boss_115": "サイファトゥは力をためない時、からだをかためて次の攻撃を大きく軽減する。\nぼうぎょ状態の時は攻撃のタイミングに気をつけよう。",
    "boss_116": "マギアは相手の残り生命が多いほど溜まりやすい。\nできるだけダメージを与えてからアイテムを使うようにしよう。",
    "boss_118": "サンゲニウスと戦う時は、氷状態や炎状態で薬草を使わないといけない状況に\nならないように気をつけよう。",
    "boss_119_a": "通常攻撃ではダメージを与えすぎないように、武器を外して攻撃しよう。",
    "boss_119_b": "カウンターや凍結、癒しの回復を活用しながら戦おう",
    "boss_120_a": "戦闘開始時に薬草を使わなくてもいいように、前の戦いではできるだけ生命を残した状態で\n終わらせるようにしよう。",
    "boss_120_b": "敵は生命が減るほど攻撃力が上がっていく。\n攻撃力が上がっていないうちは通常攻撃で戦おう。",
    "normal_auto_equip_off": "メニューの「設定を変える」から、武器の自動装備について設定できる。\n自動装備は便利なので、基本的にはONにしておこう。",
}

ITEM_INFO = {
    0: "戦闘中に使用すると生命を回復する",
    1: "敵に大きな爆発ダメージを与える",
    2: "一定ターン、敵の攻撃によるダメージを軽減する",
}

TOOL_INFO = { #アイテム説明文
    "food": "使用すると　生命が40回復する",
    "magic_water": "使用すると　生命が20回復し\nさらに魔力が20回復する",
    "magic_seed": "使用すると\n魔力が100回復する",
    "growth_essence": "使用すると　生命・攻撃・魔力を強化できる\n生命は最大値が+4、攻撃は+2、魔力は最大値と現在値が+100増加する",
    "sword_polish": "使用すると　所持している剣を1つ選び\nそのレベルを+1できる",
    "shield_harden": "使用すると　所持している盾を1つ選び\nそのレベルを+1できる",
    "armor_patch": "使用すると　所持している鎧を1つ選び\nそのレベルを+1できる",
    "truth_fragment": "洞窟の真実に関わる　特別なかけら\n持っているほど　戦闘で得られる経験値が増える",
    "warp": "使用すると　記憶した場所へ　ワープできる",
    "empty_can": "洞窟の中に落ちていた空き缶\n両親がよく飲んでいたから　見覚えがある",
    "heirloom_pendant": "「あの夜」死んだ両親が　自分に残したペンダント\n星の形をした　模様が彫られている",
}

WEAPON_INFO = {
    0: "装備すると　レベルに応じて受けるダメージが減る盾\n被弾時に　たまに敵の攻撃を大幅に軽減する",
    1: "装備すると　レベルに応じて受けるダメージが減る鎧\nターン終了時に　たまに生命が回復する",
    2: "装備すると　レベルに応じて通常攻撃のダメージが増える剣\n通常攻撃の際に　たまに会心の一撃を発動する",
    3: "装備すると　レベルに応じて受けるダメージが減る盾\n被弾時に　たまに反撃ダメージを与える",
    4: "装備すると　レベルに応じて受けるダメージが減る鎧\nターン終了時に　たまに魔力が回復する",
    5: "装備すると　レベルに応じて魔法のダメージが増える杖\n魔法攻撃の際に　たまに相手を凍らせる",
    6: "装備すると　レベルに応じて受けるダメージが減る盾\n守護の効果を強化し\n守護の継続ターンを　増加することもある",
    7: "装備すると　レベルに応じて受けるダメージが減る鎧\n傷薬の効果を強化し\n傷薬使用時に　たまにちからもたまる",
    8: "装備すると　レベルに応じて爆弾のダメージが増える武器\n爆弾の効果を強化し\n爆弾使用時に　たまに敵に毒を付与する",
}

INFO_TALK = {
    2:"しんじつのかけらは　１つのフロアで必ず１つ手に入れることができる\nできるだけ集めておくことをおすすめする\nなお　すでにかけらを手に入れた階では　左下に「取得済」と表示される",
    3:"フロアには　妖精が飛んでいることがある\n妖精は　神秘的な力で　アイテムを強化してくれる\nアイテムレベルの上限は20で　メニューの「きろくをみる」「アイテム図鑑」から確認できる",
    4:"戦闘中のコマンドは　ショートカットでも選択できる\n魔法：M、傷薬：P、爆弾：B、守護：G\nこれらを覚えておくと　戦闘がスムーズになるだろう",
    5:"魔法は　戦闘中に魔力を100消費して使うことができる\n魔力は　敵を倒すと増え　精霊水や魔結晶を使うことでも回復する",
    6:"戦闘から逃走するのも　時には重要な選択だ\nただし　しんじつのかけらを持っている敵から逃げると　その階のかけらは　取りこぼしてしまう",
    7:"ワープを使うと　一度覚えた場所にワープすることができる\nワープできる場所は　洞窟の中を進んでいくと　いくつか見つかるだろう",
    8:"知らない敵と戦う時は　「情報」から敵の情報を調べるのも重要だ\n敵の能力や弱点を把握して　戦い方を工夫するのだ",
    9:"ボスとの戦闘でも　「逃走」は選択できる\nただし　実際にボスから逃走することは　不可能だ",
    12:"武器は　強化素材でレベルをあげることができる\nレベルは９９で上限が決まっているから　頭の片隅に入れておくといいだろう",
    13:"「しんじつのかけら」は　拾い損ねても　ワープを使えば拾い直すことができる",
    14:"敵を倒した時に貰える経験値は、その敵の種類やレベルによって変わる。\nまた、敵の種類によっては特別経験値が多いものも存在する",
    16:"今まで戦った敵や　ストーリーは　メニューの「記録を見る」から　いつでも振り返ることができる",
    18:"戦闘で工夫できることはたくさんある\nたとえばボナパルト戦で傷薬を使うならば　戦闘の最初に使うべきだ\n細かい積み重ねが　終盤の資源の量に影響してくるだろう",
    19:"毒状態の時は、通常攻撃がかなり弱くなる\nただし、通常攻撃以外の特殊な攻撃の強さは変わらない",
    26:"複雑な能力を持つボスは　何度も挑んで行動を理解するのも重要だ\n１回目は倒される前提で　挑んでもいいかもしれない",
    29:"火傷状態の時は、通常攻撃が強くなる。ただし、攻撃に伴って自分もダメージをくらう\nまた、火傷状態の敵に通常攻撃すると、ダメージをくらってしまう\n複雑な効果だから、頭に入れておくといいだろう",
    32:"メニューの「設定を変える」から、武器の自動装備について設定できる\n自動装備は便利なので、基本的にはONにしておくことだ\nただし、OFFにできることも忘れないことだ。その方が戦いやすいときがくるかもしれない",
    33:"武具を強化するときは　装備中の武具が一番上に表示される\n強化する武具を間違えないように　注意することだ",
    52:"守護というアイテムは、敵の攻撃が強いほど効果を発揮するアイテムだ\n後半は特に重宝するだろう",
    62:"会心や毒霧は、武器のレベルが上がっても発生する確率は変わらない\nただし、凍結は武器のレベルが高いほど発生する確率が上がる",
    86:"どれだけ防御力が高い敵にも、カウンターと毒の効果は等しく通じる\nこれが役立つ時があるかもしれない",
}

MAZE_W = 9
MAZE_H = 7
DUNGEON_W = MAZE_W * 9
DUNGEON_H = MAZE_H * 9
